OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example13/system/blockMeshDict.column
/*--------------------------------*- C++ -*----------------------------------*
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1806                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5.666666666666667 -5.666666666666667 -1.0)
    (5.666666666666667 -5.666666666666667 -1.0)
    (5.666666666666667 5.666666666666667 -1.0)
    (-5.666666666666667 5.666666666666667 -1.0)
    (-12.020815280171307 -12.020815280171307 -1.0)
    (12.020815280171307 -12.020815280171307 -1.0)
    (12.020815280171307 12.020815280171307 -1.0)
    (-12.020815280171307 12.020815280171307 -1.0)
    (-28.991378028648448 -28.991378028648448 -1.0)
    (28.991378028648448 -28.991378028648448 -1.0)
    (28.991378028648448 28.991378028648448 -1.0)
    (-28.991378028648448 28.991378028648448 -1.0)
    (-5.666666666666667 -5.666666666666667 40.0)
    (5.666666666666667 -5.666666666666667 40.0)
    (5.666666666666667 5.666666666666667 40.0)
    (-5.666666666666667 5.666666666666667 40.0)
    (-12.020815280171307 -12.020815280171307 40.0)
    (12.020815280171307 -12.020815280171307 40.0)
    (12.020815280171307 12.020815280171307 40.0)
    (-12.020815280171307 12.020815280171307 40.0)
    (-28.991378028648448 -28.991378028648448 40.0)
    (28.991378028648448 -28.991378028648448 40.0)
    (28.991378028648448 28.991378028648448 40.0)
    (-28.991378028648448 28.991378028648448 40.0)
    (-5.666666666666667 -5.666666666666667 90.0)
    (5.666666666666667 -5.666666666666667 90.0)
    (5.666666666666667 5.666666666666667 90.0)
    (-5.666666666666667 5.666666666666667 90.0)
    (-12.020815280171307 -12.020815280171307 90.0)
    (12.020815280171307 -12.020815280171307 90.0)
    (12.020815280171307 12.020815280171307 90.0)
    (-12.020815280171307 12.020815280171307 90.0)
    (-28.991378028648448 -28.991378028648448 90.0)
    (28.991378028648448 -28.991378028648448 90.0)
    (28.991378028648448 28.991378028648448 90.0)
    (-28.991378028648448 28.991378028648448 90.0)
    (-5.666666666666667 -5.666666666666667 171.0)
    (5.666666666666667 -5.666666666666667 171.0)
    (5.666666666666667 5.666666666666667 171.0)
    (-5.666666666666667 5.666666666666667 171.0)
    (-12.020815280171307 -12.020815280171307 171.0)
    (12.020815280171307 -12.020815280171307 171.0)
    (12.020815280171307 12.020815280171307 171.0)
    (-12.020815280171307 12.020815280171307 171.0)
    (-28.991378028648448 -28.991378028648448 171.0)
    (28.991378028648448 -28.991378028648448 171.0)
    (28.991378028648448 28.991378028648448 171.0)
    (-28.991378028648448 28.991378028648448 171.0)
);

blocks
(
hex (0 1 2 3 12 13 14 15)
(25 25 25)
simpleGrading (1 1 1)
hex (4 5 1 0 16 17 13 12)
(25 25 25)
simpleGrading (1 1 1)
hex (1 5 6 2 13 17 18 14)
(25 25 25)
simpleGrading (1 1 1)
hex (3 2 6 7 15 14 18 19)
(25 25 25)
simpleGrading (1 1 1)
hex (4 0 3 7 16 12 15 19)
(25 25 25)
simpleGrading (1 1 1)
hex (8 9 5 4 20 21 17 16)
(25 25 25)
simpleGrading (1 1 1)
hex (5 9 10 6 17 21 22 18)
(25 25 25)
simpleGrading (1 1 1)
hex (7 6 10 11 19 18 22 23)
(25 25 25)
simpleGrading (1 1 1)
hex (8 4 7 11 20 16 19 23)
(25 25 25)
simpleGrading (1 1 1)
hex (12 13 14 15 24 25 26 27)
(25 25 25)
simpleGrading (1 1 1)
hex (16 17 13 12 28 29 25 24)
(25 25 25)
simpleGrading (1 1 1)
hex (13 17 18 14 25 29 30 26)
(25 25 25)
simpleGrading (1 1 1)
hex (15 14 18 19 27 26 30 31)
(25 25 25)
simpleGrading (1 1 1)
hex (16 12 15 19 28 24 27 31)
(25 25 25)
simpleGrading (1 1 1)
hex (20 21 17 16 32 33 29 28)
(25 25 25)
simpleGrading (1 1 1)
hex (17 21 22 18 29 33 34 30)
(25 25 25)
simpleGrading (1 1 1)
hex (19 18 22 23 31 30 34 35)
(25 25 25)
simpleGrading (1 1 1)
hex (20 16 19 23 32 28 31 35)
(25 25 25)
simpleGrading (1 1 1)
hex (24 25 26 27 36 37 38 39)
(25 25 25)
simpleGrading (1 1 1)
hex (28 29 25 24 40 41 37 36)
(25 25 25)
simpleGrading (1 1 1)
hex (25 29 30 26 37 41 42 38)
(25 25 25)
simpleGrading (1 1 1)
hex (27 26 30 31 39 38 42 43)
(25 25 25)
simpleGrading (1 1 1)
hex (28 24 27 31 40 36 39 43)
(25 25 25)
simpleGrading (1 1 1)
hex (32 33 29 28 44 45 41 40)
(25 25 25)
simpleGrading (1 1 1)
hex (29 33 34 30 41 45 46 42)
(25 25 25)
simpleGrading (1 1 1)
hex (31 30 34 35 43 42 46 47)
(25 25 25)
simpleGrading (1 1 1)
hex (32 28 31 35 44 40 43 47)
(25 25 25)
simpleGrading (1 1 1)
);

edges
(
    arc 4 5 (0.000000 -17.000000 -1.000000)
    arc 5 6 (17.000000 0.000000 -1.000000)
    arc 6 7 (0.000000 17.000000 -1.000000)
    arc 7 4 (-17.000000 0.000000 -1.000000)
    arc 8 9 (0.000000 -41.000000 -1.000000)
    arc 9 10 (41.000000 0.000000 -1.000000)
    arc 10 11 (0.000000 41.000000 -1.000000)
    arc 11 8 (-41.000000 0.000000 -1.000000)
    arc 16 17 (0.000000 -17.000000 40.000000)
    arc 17 18 (17.000000 0.000000 40.000000)
    arc 18 19 (0.000000 17.000000 40.000000)
    arc 19 16 (-17.000000 0.000000 40.000000)
    arc 20 21 (0.000000 -41.000000 40.000000)
    arc 21 22 (41.000000 0.000000 40.000000)
    arc 22 23 (0.000000 41.000000 40.000000)
    arc 23 20 (-41.000000 0.000000 40.000000)
    arc 28 29 (0.000000 -17.000000 90.000000)
    arc 29 30 (17.000000 0.000000 90.000000)
    arc 30 31 (0.000000 17.000000 90.000000)
    arc 31 28 (-17.000000 0.000000 90.000000)
    arc 32 33 (0.000000 -41.000000 90.000000)
    arc 33 34 (41.000000 0.000000 90.000000)
    arc 34 35 (0.000000 41.000000 90.000000)
    arc 35 32 (-41.000000 0.000000 90.000000)
    arc 40 41 (0.000000 -17.000000 171.000000)
    arc 41 42 (17.000000 0.000000 171.000000)
    arc 42 43 (0.000000 17.000000 171.000000)
    arc 43 40 (-17.000000 0.000000 171.000000)
    arc 44 45 (0.000000 -41.000000 171.000000)
    arc 45 46 (41.000000 0.000000 171.000000)
    arc 46 47 (0.000000 41.000000 171.000000)
    arc 47 44 (-41.000000 0.000000 171.000000)
);

boundary
(
);
