OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example13/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

    castellatedMesh true;
    snap true;
    addLayers true;
    geometry
    {
        Tornado_humidifier.stl
        {
            type triSurfaceMesh;
            name Tornado_humidifier;
        }

    }

    castellatedMeshControls
    {
        features
        (
        
        {
            file "Tornado_humidifier.eMesh";
            levels ((0.0 0));
            refineFeatureEdgesOnly false;
        }

        );
        refinementSurfaces
        {
            Tornado_humidifier
            {
                level ( 0 0);
                regions
                {
                    airInletYminus
                    {
                        level ( 0 0 );
                    }

                    airInletYplus
                    {
                        level ( 0 0 );
                    }

                    fin
                    {
                        level ( 0 0 );
                    }

                    bottom
                    {
                        level ( 0 0 );
                    }

                    outlet
                    {
                        level ( 0 0 );
                    }

                    top
                    {
                        level ( 0 0 );
                    }

                }

            }

        }

        refinementRegions
        {
        }

        locationInMesh ( 0.0 10.0 71.0 );
        maxLocalCells 1000000;
        maxGlobalCells 2000000;
        minRefinementCells 0;
        nCellsBetweenLevels 1;
        resolveFeatureAngle 30.0;
        allowFreeStandingZoneFaces false;
        planarAngle 30.0;
        maxLoadUnbalance 0.1;
    }

    snapControls
    {
        nSolveIter 300;
        nSmoothPatch 3;
        tolerance 1.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap true;
        explicitFeatureSnap false;
        multiRegionFeatureSnap false;
    }

    addLayersControls
    {
        layers
        {
            wall
            {
                nSurfaceLayers 0;
            }
        }

        relativeSizes true;
        expansionRatio 1.0;
        finalLayerThickness 0.3;
        minThickness 0.2;
        nGrow 0;
        featureAngle 60.0;
        slipFeatureAngle 30.0;
        nRelaxIter 3;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        minMedianAxisAngle 90;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 65.0;
        maxBoundarySkewness 20;
        maxInternalSkewness 4;
        maxConcave 80.0;
        minFlatness 0.5;
        minVol 1.0E-13;
        minTetQuality -1.0E30;
        minArea -1.0;
        minTwist 0.02;
        minDeterminant 0.001;
        minFaceWeight 0.02;
        minVolRatio 0.01;
        minTriangleTwist -1.0;
        nSmoothScale 4;
        errorReduction 0.75;
    }

    debug 0;
    mergeTolerance 1.0E-6;
    autoBlockMesh false;
