OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example13/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object turbulenceProperties;
}

    //simulationType laminar;

    simulationType RAS;

    RAS
    {
        RASModel        kEpsilon;

        turbulence      on;

        printCoeffs     on;
    }
