OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example13/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}

    transportModel Newtonian;
    nu nu [0 2 -1 0 0 0 0 ] 1.805e-04;
    materialName material;