OpenFOAM_v2112/ChapterSample/chapter10_meshCreate/example13/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

runApplication decomposePar

runParallel $(getApplication)

runApplication reconstructPar -latestTime
touch mesh.foam
#------------------------------------------------------------------------------
